Bwooce/tinygs_nRF52/src/main.cpp
                            radio->setRxBoostedGainMode(true);
                        }
                    }

                    /* Parse filter (array — not handled by json.h descriptors) */
                    int filt_count = tinygs_parse_filter(
                        tinygs_radio.modem_conf, strlen(tinygs_radio.modem_conf),
                        tinygs_radio.filter, sizeof(tinygs_radio.filter));
                    tinygs_radio.filter_len = (filt_count > 0) ? filt_count : 0;
                    if (filt_count <= 0) tinygs_radio.filter[0] = 0;

                    /* Parse TLE base64 from modem_conf copy.
                     * "tle" key = active Doppler compensation
                     * "tlx" key = passive TLE (position display only, no Doppler) */
                    const char *tle_p = strstr(tinygs_radio.modem_conf, "\"tle\":\"");
                    const char *tlx_p = strstr(tinygs_radio.modem_conf, "\"tlx\":\"");
                    const char *tle_key = tle_p ? tle_p : tlx_p;
                    bool active_doppler = (tle_p != NULL);

                    if (tle_key) {
                        const char *b64_start = tle_key + 7; /* skip "tle":"  or "tlx":" (7 chars) */
                        const char *b64_end = strchr(b64_start, '"');
                        if (b64_end) {
                            size_t decoded_len = 0;
                            if (base64_decode((uint8_t *)tinygs_radio.tle,
                                              sizeof(tinygs_radio.tle),
                                              &decoded_len,
                                              (const uint8_t *)b64_start,
                                              b64_end - b64_start) == 0
                                && decoded_len >= 34
                                && decoded_len <= sizeof(tinygs_radio.tle)) {
                                tinygs_radio.tle_valid = true;
                                tinygs_radio.doppler_enabled = active_doppler;
                                tinygs_radio.freq_doppler = 0.0f;
                                LOG_INF("  TLE received (%zu bytes)%s",
                                        decoded_len, active_doppler ? " +Doppler" : "");
                            } else {
                                tinygs_radio.tle_valid = false;
                            }
                        }
                    } else {
                        tinygs_radio.tle_valid = false;
                        tinygs_radio.doppler_enabled = false;
                    }

                    /* Re-enable RX interrupt and start receiving */
                    radio->setPacketReceivedAction(lora_rx_callback);
                    radio->startReceive();

                    /* tle_tag: "TLE" = active Doppler (server sent "tle" key),
                     *          "TLX" = passive map data only (server sent "tlx"),
                     *          ""    = no orbit data at all. */
                    const char *tle_tag = tinygs_radio.tle_valid
                        ? (tinygs_radio.doppler_enabled ? " TLE" : " TLX")
                        : "";
                    if (strcmp(tinygs_radio.modem_mode, "FSK") == 0) {
                        LOG_INF("  → %s %.4fMHz FSK BR%.0f BW%.1f%s%s",
                                tinygs_radio.satellite,
                                (double)tinygs_radio.frequency,
                                (double)tinygs_radio.bitrate,
                                (double)tinygs_radio.bw,
                                tle_tag,
                                tinygs_radio.filter[0] ? " FLT" : "");
                    } else {
                        LOG_INF("  → %s %.4fMHz SF%d BW%.1f%s%s",
                                tinygs_radio.satellite,
                                (double)tinygs_radio.frequency,
                                tinygs_radio.sf,
                                (double)tinygs_radio.bw,
                                tle_tag,
                                tinygs_radio.filter[0] ? " FLT" : "");
                    }
                }
            } else if (strcmp(cmnd, "begin_lora") == 0) {
                /* Legacy array format: [freq,bw,sf,cr,sw,pwr,climit,pl,gain] */
                if (radio) {
                    radio->clearPacketReceivedAction();
                    if (lora_packet_received) lora_packet_received = false;
                    float vals[9] = {0};
                    const char *p = strchr((char *)rx_payload, '[');
                    if (p) {
                        p++;
                        for (int i = 0; i < 9 && *p && *p != ']'; i++) {
                            vals[i] = strtof(p, (char **)&p);
                            while (*p == ',' || *p == ' ') p++;
                        }
                        float freq = vals[0];
                        if (freq > 100.0f && freq < 1000.0f) {
                            tinygs_radio.frequency = freq;
                            radio->setFrequency(freq + tinygs_radio.freq_offset / 1e6f);
                            radio->setBandwidth(vals[1]); tinygs_radio.bw = vals[1];
                            radio->setSpreadingFactor((int)vals[2]); tinygs_radio.sf = (int)vals[2];
                            radio->setCodingRate((int)vals[3]); tinygs_radio.cr = (int)vals[3];
                            radio->setSyncWord((int)vals[4]);
                            radio->setPreambleLength((int)vals[7]);
                            radio->setRxBoostedGainMode(true);
                            strncpy(tinygs_radio.modem_mode, "LoRa", sizeof(tinygs_radio.modem_mode));
                            radio->setPacketReceivedAction(lora_rx_callback);
                            radio->startReceive();
                            LOG_INF("  begin_lora: %.4fMHz SF%d BW%.1f",
                                    (double)freq, (int)vals[2], (double)vals[1]);
                        }
                    }
                }
            } else if (strcmp(cmnd, "begin_fsk") == 0) {
                /* Legacy array format: [freq,br,fd,rxBw,pwr,pl,ook,len] */
                if (radio) {
                    radio->clearPacketReceivedAction();
                    if (lora_packet_received) lora_packet_received = false;
                    float vals[8] = {0};
                    const char *p = strchr((char *)rx_payload, '[');
                    if (p) {
                        p++;
                        for (int i = 0; i < 8 && *p && *p != ']'; i++) {
                            vals[i] = strtof(p, (char **)&p);
                            while (*p == ',' || *p == ' ') p++;
                        }
                        float freq = vals[0];
                        if (freq > 100.0f && freq < 1000.0f) {
                            tinygs_radio.frequency = freq;
                            tinygs_radio.bw = vals[3];
                            tinygs_radio.bitrate = vals[1];
                            tinygs_radio.freq_dev = vals[2];
                            tinygs_radio.ook = (int)vals[6];
                            tinygs_radio.fsk_len = (int)vals[7];
                            strncpy(tinygs_radio.modem_mode, "FSK", sizeof(tinygs_radio.modem_mode));
                            int16_t rc = radio->beginFSK(
                                freq + tinygs_radio.freq_offset / 1e6f,
                                vals[1] / 1000.0f, vals[2] / 1000.0f, vals[3],
                                (int)vals[4], (int)vals[5], LORA_TCXO_VOLTAGE);
                            if (rc == RADIOLIB_ERR_NONE) {
                                radio->setPacketReceivedAction(lora_rx_callback);
                                radio->setCRC(0);
                                if ((int)vals[7] > 0) radio->fixedPacketLengthMode((int)vals[7]);
                                radio->setRxBoostedGainMode(true);
                                radio->startReceive();
                                LOG_INF("  begin_fsk: %.4fMHz BR%.0f FD%.0f",
                                        (double)freq, (double)vals[1], (double)vals[2]);
                            } else {
                                LOG_ERR("  begin_fsk failed: %d (%s)", rc, radio_err_name(rc));
                            }
                        }
                    }
                }
            } else if (strcmp(cmnd, "freq") == 0) {
                /* Direct frequency set (MHz as number) */
                float freq = strtof((char *)rx_payload, NULL);
                if (radio && freq > 100.0f && freq < 1000.0f) {
                    tinygs_radio.frequency = freq;
                    radio->setFrequency(freq + tinygs_radio.freq_offset / 1e6f);
                    radio->startReceive();
                    LOG_INF("  → freq=%.4f MHz (foff=%.0f Hz)",
                            (double)freq, (double)tinygs_radio.freq_offset);
                }
            } else if (strcmp(cmnd, "sat") == 0) {
                /* Select satellite — payload is ["name", NORAD] */
                const char *p = strstr((char *)rx_payload, "\"");
                if (p) {
                    const char *end = strchr(p + 1, '"');
                    if (end && (end - p - 1) < (int)sizeof(tinygs_radio.satellite)) {
                        memcpy(tinygs_radio.satellite, p + 1, end - p - 1);
                        tinygs_radio.satellite[end - p - 1] = '\0';
                        /* Parse NORAD after the closing quote: ,"12345"] */
                        const char *comma = strchr(end, ',');
                        if (comma) {
                            tinygs_radio.norad = (uint32_t)atoi(comma + 1);
                        }
                        LOG_INF("  → satellite: %s NORAD=%u",
                                tinygs_radio.satellite, (unsigned)tinygs_radio.norad);
                    }
                }
            } else if (strcmp(cmnd, "set_pos_prm") == 0) {
                tinygs_handle_set_pos((char *)rx_payload, ret);
            } else if (strcmp(cmnd, "set_name") == 0) {
                extern char device_client_id[13];
                struct tinygs_name_msg name_msg;
                if (tinygs_parse_set_name((char *)rx_payload, ret, &name_msg) == 0) {
                    if (strcmp(name_msg.mac, device_client_id) == 0) {
                        strncpy(cfg_station, name_msg.name, sizeof(cfg_station) - 1);
                        cfg_station[sizeof(cfg_station) - 1] = '\0';
                        tinygs_config_save_station(cfg_station);
                        LOG_INF("  → Renamed to: %s (saved, rebooting)", cfg_station);
                        k_msleep(500);
                        sys_reboot(SYS_REBOOT_COLD);
                    } else {
                        LOG_DBG("  → set_name: MAC mismatch");
                    }
                }
            } else if (strcmp(cmnd, "status") == 0) {
                tinygs_send_status(client, cfg_mqtt_user, cfg_station);
            } else if (strcmp(cmnd, "reset") == 0) {
                LOG_WRN("*** SERVER RESET — rebooting ***");
                mqtt_disconnect(client);
                k_msleep(2000);
                sys_reboot(SYS_REBOOT_COLD);
            } else if (strcmp(cmnd, "tx") == 0) {
                /* TX is gated on cfg_tx_enable. Default off — we advertise
                 * tx:false in welcome and the server then never schedules
                 * this command. Kept only as a hook for operators who set
                 * tx_enable:1 in config.json and have the antenna/licensing
                 * to actually transmit. Returning to RX after TX is best-
                 * effort. */
                if (!cfg_tx_enable) {
                    LOG_WRN("  → TX refused (cfg_tx_enable=0, RX-only station)");
                } else if (radio && ret > 0) {
                    int16_t trc = radio->transmit((const uint8_t *)rx_payload, ret);
                    radio->startReceive();
                    LOG_INF("  → TX %zu bytes, rc=%d", (size_t)ret, trc);
                } else {
                    LOG_WRN("  → TX skipped (no radio or empty payload)");
                }
            } else if (strcmp(cmnd, "log") == 0) {
                LOG_INF("  → Server: %s", (char *)rx_payload);
            } else if (strcmp(cmnd, "sleep") == 0 || strcmp(cmnd, "siesta") == 0) {
                uint32_t secs = tinygs_parse_sleep((char *)rx_payload, ret);
                if (secs == 0) {
                    LOG_WRN("  → %s: invalid payload, ignoring", cmnd);
                } else {
                    LOG_INF("  → %s: %u seconds", cmnd, secs);

