Bwooce/tinygs_nRF52/src/main.cpp
/* USB VBUS state tracking — only enable USB stack when a cable is present.
 * Saves ~1 mA on battery by letting HFXO release when USBD is disabled.
 * Polled from the main loop with a debounce so a flaky cable doesn't
 * thrash the stack. */
static bool usb_is_enabled = false;
static bool last_vbus_state = false;
static uint32_t vbus_change_ms = 0;
#define USB_VBUS_DEBOUNCE_MS 2000

static inline bool usb_vbus_present(void)
{
    return (NRF_POWER->USBREGSTATUS & POWER_USBREGSTATUS_VBUSDETECT_Msk) != 0;
}

/* VBUS poll runs on the system workqueue so hot-plug detection works
 * regardless of where the connection state machine is parked. The
 * MQTT-loop variant only fired in STATE_MQTT_CONNECTED — meaning a
 * device stuck in STATE_WAIT_THREAD or STATE_ERROR after a BR outage
 * would never see the user plug in to debug. */
#define USB_VBUS_POLL_MS  250  /* 4 Hz — debounce window holds 8 samples */
static void usb_vbus_work_handler(struct k_work *work);
static K_WORK_DELAYABLE_DEFINE(usb_vbus_work, usb_vbus_work_handler);

static void usb_vbus_work_handler(struct k_work *work)
{
    ARG_UNUSED(work);

    bool now_present = usb_vbus_present();
    uint32_t now_ms = k_uptime_get_32();

    if (now_present != last_vbus_state) {
        last_vbus_state = now_present;
        vbus_change_ms = now_ms;
    } else if (now_present != usb_is_enabled &&
               (now_ms - vbus_change_ms) >= USB_VBUS_DEBOUNCE_MS) {
        if (now_present) {
            if (usb_enable(NULL) == 0) {
                usb_is_enabled = true;
                LOG_INF("USB cable detected — stack enabled (MSC + CDC ACM)");
            } else {
                LOG_WRN("USB cable detected but usb_enable() failed");
            }
        } else {
            usb_disable();
            usb_is_enabled = false;
            LOG_INF("USB cable removed — stack disabled (~1 mA saved)");
        }
    }

    k_work_reschedule(&usb_vbus_work, K_MSEC(USB_VBUS_POLL_MS));
}

static void setup_usb_storage(void)
{
    struct fs_file_t file;
    struct fs_dirent entry;

    LOG_INF("Mounting FATFS...");

    /* Check FAT boot sector signature BEFORE mounting. FatFs will crash
     * (HardFault) on corrupted FAT data because it follows garbage pointers.
     * Reading raw flash is safe — no FatFs code involved. If invalid,
     * format through the disk driver (which manages the write cache). */
    {
        const struct device *flash_dev = DEVICE_DT_GET(DT_CHOSEN(zephyr_flash_controller));
        uint8_t sig[2];
        flash_read(flash_dev, 0xE2000 + 510, sig, 2);
        if (sig[0] == 0xFF && sig[1] == 0xFF) {
            /* Erased flash — fs_mount with MOUNT_MKFS will auto-format */
            LOG_INF("FATFS: partition erased, will auto-format on mount");
        } else if (sig[0] != 0x55 || sig[1] != 0xAA) {
            /* Corrupted data — erase partition and reboot to avoid FatFs crash */
            LOG_WRN("FATFS: corrupt boot sector (0x%02X 0x%02X), erasing",
                    sig[0], sig[1]);
            flash_erase(flash_dev, 0xE2000, 0x6000);
            LOG_INF("Partition erased, rebooting...");
            k_msleep(100);
            sys_reboot(SYS_REBOOT_COLD);
        }
    }

    int res = fs_mount(&mp);
    LOG_INF("FATFS mount: %d (%s)", res, res < 0 ? errno_name(res) : "OK");

    if (res == 0) {
        /* Write index.html with commissioning info (only if missing) */
        if (fs_stat("/NAND:/index.html", &entry) != 0) {
            /* Get EUI-64 for commissioning info */
            extern char device_client_id[13];
            if (device_client_id[0] == '\0') {
                uint64_t dev_id = NRF_FICR->DEVICEID[0] |
                                  ((uint64_t)NRF_FICR->DEVICEID[1] << 32);
                snprintf(device_client_id, sizeof(device_client_id),
                         "%04X%08X", (unsigned)(dev_id >> 32), (unsigned)dev_id);
            }

            fs_file_t_init(&file);
            if (fs_open(&file, "/NAND:/index.html", FS_O_CREATE | FS_O_WRITE) == 0) {
                /* Write static HTML head */
                fs_write(&file, html_content, strlen(html_content));

                /* Append commissioning info */
                static char commission_html[256];
                int clen = snprintf(commission_html, sizeof(commission_html),
                    "<div class='card' style='margin-top:16px;'>"
                    "<h2>Thread Commissioning</h2>"
                    "<p><strong>MAC / EUI-64:</strong> %s</p>"
                    "<p><strong>Joiner PSKd:</strong> %s</p>"
                    "<p style='font-size:0.8em;color:#666;'>"
                    "Run on your OTBR: <code>ot-ctl commissioner joiner add '*' %s</code></p>"
                    "</div></body></html>",
                    device_client_id,
                    CONFIG_OPENTHREAD_JOINER_PSKD,
                    CONFIG_OPENTHREAD_JOINER_PSKD);
                fs_write(&file, commission_html, clen);
                fs_sync(&file);
                fs_close(&file);
            }
        }

        /* Config.json sync — NVS-authoritative, with user-edit detection
         * via snapshot diff:
         *
         *   NVS is the source of truth. cfg_last_snapshot (also in NVS)
         *   holds an exact copy of the last config.json the device wrote.
         *   On boot we compare the file content against the snapshot:
         *     - Match → no user edit since last write → ignore file,
         *       regenerate it from current memory (which is NVS-loaded).
         *     - Differ on a particular field → user edited that field
         *       since last boot → push new value to memory + NVS.
         *
         *   This is the only way to distinguish a user edit from a
         *   stale-file-vs-server-updated-NVS state, because both
         *   produce file ≠ memory.
         *
         *   Then we always rewrite config.json from current memory and
         *   save the new snapshot, so the next boot has a fresh
         *   reference for diffing.
         */
        {
            static char file_buf[TINYGS_CONFIG_SNAPSHOT_MAX];
            struct fs_file_t cfg;
            ssize_t file_n = -1;

            /* Read current config.json into file_buf (may not exist on
             * a freshly-formatted partition — that's fine, we'll just
             * skip the diff and write defaults). */
            fs_file_t_init(&cfg);
            if (fs_open(&cfg, "/NAND:/config.json", FS_O_READ) == 0) {
                file_n = fs_read(&cfg, file_buf, sizeof(file_buf) - 1);
                fs_close(&cfg);
                if (file_n > 0) {
                    file_buf[file_n] = '\0';
                    LOG_INF("Config: read config.json (%d bytes)", (int)file_n);
                } else {
                    file_n = -1;
                }
            }

