Bwooce/tinygs_nRF52/src/main.cpp
            /* For each field: parse the value from BOTH file and snapshot.
             * If they differ → user edit on that field → apply to memory
             * and persist to NVS. snapshot empty (first boot or after
             * NVS wipe) means we can't tell user edits from defaults; in
             * that case treat file values as authoritative for first-time
             * setup, but only when they look reasonable. */
            bool have_snapshot = (cfg_last_snapshot[0] != '\0');
            bool have_file = (file_n > 0);
            int edits = 0;

            #define DIFF_AND_APPLY_FLOAT(key, mem_var, range_lo, range_hi, save_call) do { \
                if (have_file) {                                                            \
                    float fv = json_extract_float(file_buf, key, -9999.0f);                \
                    float sv = have_snapshot ?                                              \
                        json_extract_float(cfg_last_snapshot, key, -9999.0f) :             \
                        -9999.0f;                                                           \
                    float dv = fv - sv;                                                    \
                    if (dv < 0) dv = -dv;                                                   \
                    bool edited = have_snapshot ? (dv > 0.0001f)                            \
                                                 : (fv != -9999.0f);                       \
                    if (edited && fv >= (range_lo) && fv <= (range_hi)) {                  \
                        LOG_INF("Config: user edit '%s' %.4f -> %.4f, persisting",         \
                                key, (double)(mem_var), (double)fv);                       \
                        (mem_var) = fv;                                                    \
                        save_call;                                                          \
                        edits++;                                                            \
                    }                                                                       \
                }                                                                           \
            } while (0)

            #define DIFF_AND_APPLY_STR(key, mem_var, save_call) do {                       \
                if (have_file) {                                                            \
                    char fv[sizeof(mem_var)] = "";                                          \
                    char sv[sizeof(mem_var)] = "";                                          \
                    int fv_found = json_extract_string(file_buf, key, fv, sizeof(fv));     \
                    if (have_snapshot) {                                                    \
                        json_extract_string(cfg_last_snapshot, key, sv, sizeof(sv));       \
                    }                                                                       \
                    /* Treat key-missing-from-file as "user did not touch this field"      \
                     * — never wipe a stored value because the file got truncated or       \
                     * the user removed the line. fv_found < 0 means strstr missed. */    \
                    bool edited = (fv_found >= 0) &&                                        \
                                  (have_snapshot ? (strcmp(fv, sv) != 0)                   \
                                                 : (fv[0] != '\0'));                        \
                    if (edited) {                                                           \
                        LOG_INF("Config: user edit '%s' '%s' -> '%s', persisting",         \
                                key, (mem_var), fv);                                       \
                        strncpy((mem_var), fv, sizeof(mem_var) - 1);                       \
                        (mem_var)[sizeof(mem_var) - 1] = '\0';                             \
                        save_call;                                                          \
                        edits++;                                                            \
                    }                                                                       \
                }                                                                           \
            } while (0)

            DIFF_AND_APPLY_FLOAT("\"lat\":", tinygs_station_lat, -90.0f, 90.0f,
                tinygs_config_save_location(tinygs_station_lat,
                                            tinygs_station_lon,
                                            tinygs_station_alt));
            DIFF_AND_APPLY_FLOAT("\"lon\":", tinygs_station_lon, -180.0f, 180.0f,
                tinygs_config_save_location(tinygs_station_lat,
                                            tinygs_station_lon,
                                            tinygs_station_alt));
            DIFF_AND_APPLY_FLOAT("\"alt\":", tinygs_station_alt, -500.0f, 9000.0f,
                tinygs_config_save_location(tinygs_station_lat,
                                            tinygs_station_lon,
                                            tinygs_station_alt));

            DIFF_AND_APPLY_STR("\"station\":\"", cfg_station,
                tinygs_config_save_station(cfg_station));
            DIFF_AND_APPLY_STR("\"mqtt_user\":\"", cfg_mqtt_user,
                tinygs_config_save("user", cfg_mqtt_user, strlen(cfg_mqtt_user)));
            DIFF_AND_APPLY_STR("\"mqtt_pass\":\"", cfg_mqtt_pass,
                tinygs_config_save("pass", cfg_mqtt_pass, strlen(cfg_mqtt_pass)));

            /* tx_enable — JSON bool. Match against snapshot the same way. */
            if (have_file) {
                int fv = json_extract_bool(file_buf, "\"tx_enable\":", -1);
                int sv = have_snapshot ?
                    json_extract_bool(cfg_last_snapshot, "\"tx_enable\":", -1) :
                    -1;
                bool edited = have_snapshot ? (fv != sv) : (fv != -1);
                if (edited && fv != -1) {
                    LOG_INF("Config: user edit 'tx_enable' %d -> %d, persisting",
                            (int)cfg_tx_enable, fv);
                    cfg_tx_enable = (int8_t)fv;
                    int8_t v = cfg_tx_enable;
                    tinygs_config_save("tx", &v, sizeof(v));
                    edits++;
                }
            }

            #undef DIFF_AND_APPLY_FLOAT
            #undef DIFF_AND_APPLY_STR

            if (edits > 0) {
                LOG_INF("Config: applied %d user edit(s) from config.json", edits);
            } else if (have_file) {
                LOG_INF("Config: no user edits since last write");
            } else {
                LOG_INF("Config: no config.json on drive — will create from current state");
            }

