Bwooce/tinygs_nRF52/src/main.cpp
            /* Always rewrite config.json from current memory (which now
             * reflects NVS state plus any user edits we just absorbed)
             * and snapshot it, so next boot's diff has a fresh baseline. */
            fs_file_t_init(&cfg);
            if (fs_open(&cfg, "/NAND:/config.json", FS_O_CREATE | FS_O_WRITE) == 0) {
                int len = snprintf(file_buf, sizeof(file_buf),
                    "{\n"
                    "  \"station\": \"%s\",\n"
                    "  \"mqtt_user\": \"%s\",\n"
                    "  \"mqtt_pass\": \"%s\",\n"
                    "  \"lat\": %.4f,\n"
                    "  \"lon\": %.4f,\n"
                    "  \"alt\": %.0f,\n"
                    "  \"display_timeout\": 30,\n"
                    "  \"tx_enable\": %s\n"
                    "}\n",
                    cfg_station, cfg_mqtt_user, cfg_mqtt_pass,
                    (double)tinygs_station_lat,
                    (double)tinygs_station_lon,
                    (double)tinygs_station_alt,
                    cfg_tx_enable ? "true" : "false");
                /* snprintf returns the would-have-written length, which
                 * can exceed the buffer if a future field bloats things.
                 * Cap to actual buffer fill so fs_write can't read past
                 * file_buf into adjacent BSS. */
                if (len < 0) len = 0;
                if ((size_t)len >= sizeof(file_buf)) len = sizeof(file_buf) - 1;
                /* fs_write may return short on a full disk; truncate
                 * before write so the file size matches len exactly. */
                fs_truncate(&cfg, 0);
                fs_write(&cfg, file_buf, len);
                fs_sync(&cfg);
                fs_close(&cfg);
                /* Only re-save the snapshot if the rendered file content
                 * actually changed. Without this guard we'd add one NVS
                 * write per boot; with it, we only write on real state
                 * change (user edit, server-driven NVS update that flowed
                 * through to a rendered field, or first boot). */
                if (strcmp(file_buf, cfg_last_snapshot) != 0) {
                    tinygs_config_save_snapshot(file_buf);
                    LOG_INF("Config: wrote config.json (%d bytes), snapshot updated", len);
                } else {
                    LOG_INF("Config: wrote config.json (%d bytes), snapshot unchanged", len);
                }
            }
        }

        /* Flush and unmount before USB MSC takes over */
        disk_access_ioctl("NAND", DISK_IOCTL_CTRL_SYNC, NULL);
        fs_unmount(&mp);
    }

    /* USB is already enabled in main() before this function is called */
}

/* -------------------------------------------------------------------------- */
/* -------------------------------------------------------------------------- */
/* RadioLib — radio type selected by DTS compatible                             */
/* -------------------------------------------------------------------------- */

static ZephyrHal radio_hal(lora_spi.bus, (struct spi_config *)&lora_spi.config);
static Module *radio_mod = nullptr;
/* Radio type from DTS compatible — compile-time selection */
#define LORA_NODE DT_ALIAS(lora0)
#if DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1262)
  SX1262 *radio = nullptr;
#elif DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1268)
  SX1268 *radio = nullptr;
#elif DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1276)
  SX1276 *radio = nullptr;
#elif DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1278)
  SX1278 *radio = nullptr;
#else
  #error "Unsupported LoRa radio — check lora0 alias in app.overlay"
#endif

/* LoRa packet reception flag — set by DIO1 ISR */
/* lora_packet_received moved to top — see forward declaration */

/* -------------------------------------------------------------------------- */
/* SNTP Time Sync                                                              */
/* -------------------------------------------------------------------------- */

/* Offset in milliseconds — same unit as k_uptime_get(), so the common
 * case is one add. real_epoch_ms = k_uptime_get() + sntp_epoch_offset_ms.
 * Scale to seconds or microseconds only at the point of use. SNTP's aTime
 * is whole-second anyway, so storing in ms gives us all the precision we
 * can claim; storing in µs would just pad zeros on the low end. */
static int64_t sntp_epoch_offset_ms = 0;
static bool time_synced = false;

/* Signalled by sntp_response_handler so sntp_sync() can block the state
 * machine until we have a real epoch (or a hard timeout). Welcome payload
 * carries the `time` field, so we must sync *before* CONNACK. */
static K_SEM_DEFINE(sntp_sem, 0, 1);

int64_t get_utc_epoch_us(void)
{
    if (!time_synced) return 0;
    return (k_uptime_get() + sntp_epoch_offset_ms) * 1000LL;
}

int64_t get_utc_epoch(void)
{
    if (!time_synced) return 0;
    return (k_uptime_get() + sntp_epoch_offset_ms) / 1000LL;
}

/* SNTP callback — called from OpenThread context */
static void sntp_response_handler(void *aContext, uint64_t aTime, otError aResult)
{
    if (aResult == OT_ERROR_NONE) {
        sntp_epoch_offset_ms = (int64_t)aTime * 1000LL - k_uptime_get();
        time_synced = true;
        LOG_INF("SNTP: synced, epoch=%llu", (unsigned long long)aTime);
    } else {
        LOG_WRN("SNTP: failed (%d %s)", (int)aResult, otThreadErrorToString(aResult));
    }
    k_sem_give(&sntp_sem);
}

/**
 * Sync time via OpenThread SNTP client.
 * Uses Google NTP (2001:4860:4806:8::) — native IPv6, no NAT64 needed.
 */
static void sntp_sync(void)
{
    struct openthread_context *ot_ctx = openthread_get_default_context();
    if (!ot_ctx) return;

    /* Resolve TINYGS_SNTP_HOSTNAME through the same DNS path the MQTT
     * client uses. The resolver returns a NAT64-synthesised AAAA for the
     * IPv4 NTP server the pool picks today — so no hardcoded IPv4 to go
     * stale, and no extra failure mode (if DNS is broken, MQTT is broken
     * too and the station is already down). Cached statically: resolve
     * on first use, reuse for subsequent re-syncs. */
    static otIp6Address sntp_peer_addr;
    static bool sntp_peer_resolved = false;
    if (!sntp_peer_resolved) {
        if (resolve_ipv4_hostname(TINYGS_SNTP_HOSTNAME, &sntp_peer_addr) != 0) {
            LOG_WRN("SNTP: hostname resolution failed, skipping sync");
            return;
        }
        sntp_peer_resolved = true;
    }

    otMessageInfo msgInfo;
    memset(&msgInfo, 0, sizeof(msgInfo));
    msgInfo.mPeerAddr = sntp_peer_addr;
    msgInfo.mPeerPort = TINYGS_SNTP_SERVER_PORT;

    char sntp_str[OT_IP6_ADDRESS_STRING_SIZE];
    otIp6AddressToString(&msgInfo.mPeerAddr, sntp_str, sizeof(sntp_str));
    LOG_INF("SNTP: query to %s [%s]:%u",
            TINYGS_SNTP_HOSTNAME, sntp_str, (unsigned)msgInfo.mPeerPort);

    otSntpQuery query;
    query.mMessageInfo = &msgInfo;

    k_sem_reset(&sntp_sem);

    openthread_api_mutex_lock(ot_ctx);
    otError err = otSntpClientQuery(ot_ctx->instance, &query,
                                     sntp_response_handler, NULL);
    openthread_api_mutex_unlock(ot_ctx);

