Bwooce/tinygs_nRF52/src/main.cpp
/* -------------------------------------------------------------------------- */
/* Main                                                                        */
/* -------------------------------------------------------------------------- */

int main(void)
{
    const struct device *const console_dev = DEVICE_DT_GET(DT_CHOSEN(zephyr_console));
    uint32_t dtr = 0;

    if (device_is_ready(console_dev)) {
        cdc_acm_dte_rate_callback_set(console_dev, baudrate_reset_handler);
    }

    enable_peripherals();

    /* NVS (settings) BEFORE FATFS so the runtime variables hold the
     * authoritative server-side state when setup_usb_storage() reads
     * config.json. settings_subsys_init() is idempotent and only needs
     * the flash driver, which Zephyr SYS_INITs before main() runs.
     * Without this ordering: USB writes config.json from compiled
     * defaults (NVS not yet loaded), then NVS load overwrites memory
     * — config.json on the drive ends up stuck at defaults forever
     * even after server-driven NVS updates. */
    tinygs_config_init();

    /* FATFS operations BEFORE USB enable — mount, write, read, unmount.
     * Must complete before USB MSC goes live to avoid concurrent access. */
    setup_usb_storage();

    /* Enable USB composite (CDC ACM console + MSC drive) only if a cable
     * is plugged in. The usb_vbus_work delayable on the system workqueue
     * (scheduled below) handles hot-plug later, regardless of which
     * connection state the main loop is parked in. Skipping usb_enable()
     * on battery saves ~1 mA. */
    last_vbus_state = usb_vbus_present();
    vbus_change_ms = k_uptime_get_32();
    if (last_vbus_state) {
        if (usb_enable(NULL) == 0) {
            usb_is_enabled = true;
            LOG_INF("USB active (MSC + CDC ACM)");
        }
    } else {
        LOG_INF("USB cable absent at boot — stack stays disabled");
    }

    /* Wait briefly for serial monitor to connect — only if USB is up.
     * Without this guard the DTR poll wastes 3 s on battery boots. */
    if (usb_is_enabled) {
        for (int i = 0; i < 30 && !dtr; i++) {
            uart_line_ctrl_get(console_dev, UART_LINE_CTRL_DTR, &dtr);
            k_msleep(100);
        }
    }

    /* Start the VBUS poll on the system workqueue. Runs every 250 ms
     * regardless of state-machine position so hot-plug works even when
     * the device is stuck in STATE_WAIT_THREAD or STATE_ERROR. */
    k_work_schedule(&usb_vbus_work, K_MSEC(USB_VBUS_POLL_MS));

    LOG_INF("=== TinyGS nRF52 v%u — Thread/MQTT-TLS ===", (unsigned)TINYGS_VERSION);

    /* Log boot/reset reason — read raw nRF RESETREAS for full picture.
     * Errata 136: after pin reset, other bits may be falsely set. */
    {
        uint32_t resetreas = NRF_POWER->RESETREAS;
        NRF_POWER->RESETREAS = resetreas; /* Clear by writing 1s */
        uint32_t gpregret = nrf_power_gpregret_get(NRF_POWER, 0);

        LOG_INF("Boot: RESETREAS=0x%08x gpregret=0x%02x [%s%s%s%s%s%s]",
                resetreas, gpregret,
                (resetreas & (1<<0)) ? "PIN " : "",
                (resetreas & (1<<1)) ? "DOG " : "",
                (resetreas & (1<<2)) ? "SREQ " : "",
                (resetreas & (1<<3)) ? "LOCKUP " : "",
                (resetreas & (1<<16)) ? "OFF " : "",
                (resetreas & (1<<17)) ? "DIF " : "");

        if (gpregret == 0x57) {
            LOG_INF("  → 1200-baud bootloader entry");
        }
        if (resetreas & (1<<3)) {
            LOG_ERR("  → CPU LOCKUP detected! (fault-in-fault-handler)");
        }
    }

    /* Check for crash diagnostic from previous boot (retained RAM) */
    if ((crash_reason & 0xFFFF0000) == CRASH_MAGIC) {
        uint32_t vectactive = crash_icsr & 0x1FF;
        int irq_num = (int)vectactive - 16;
        unsigned r = crash_reason & 0xFFFF;
        static const char *reason_names[] = {
            "CPU_EXCEPTION", "SPURIOUS_IRQ", "STACK_CHK_FAIL",
            "KERNEL_OOPS",   "KERNEL_PANIC"
        };
        const char *reason_str = (r < ARRAY_SIZE(reason_names)) ? reason_names[r] : "ARCH_SPECIFIC";
        /* nRF52840 external IRQ number → peripheral name */
        static const char *irq_names[] = {
            "POWER_CLOCK","RADIO","UARTE0","SPI0","SPI1","NFCT","GPIOTE","SAADC",
            "TIMER0","TIMER1","TIMER2","RTC0","TEMP","RNG","ECB","CCM_AAR",
            "WDT","RTC1","QDEC","COMP","SWI0","SWI1","SWI2","SWI3","SWI4","SWI5",
            "TIMER3","TIMER4","PWM0","PDM","res30","res31","MWU","PWM1","PWM2",
            "SPI2","RTC2","I2S","FPU","USBD","UARTE1","QSPI","CRYPTOCELL"
        };
        const char *irq_str = (irq_num >= 0 && irq_num < (int)ARRAY_SIZE(irq_names))
                               ? irq_names[irq_num] : "?";
        LOG_ERR("*** PREVIOUS CRASH: thread='%s'(%p) reason=%u(%s) PC=0x%08x LR=0x%08x ICSR=0x%08x IRQ=%d(%s) ***",
                crash_thread[0] ? crash_thread : "?",
                (void *)(uintptr_t)crash_thread_ptr,
                r, reason_str,
                (unsigned)crash_pc, (unsigned)crash_lr,
                (unsigned)crash_icsr, irq_num, irq_str);
        LOG_ERR("Use: arm-zephyr-eabi-addr2line -e build/zephyr/zephyr.elf 0x%08x",
                (unsigned)crash_pc);
        crash_reason = 0; /* Clear so we don't report again */
    }

    log_heap_usage("boot");
    init_openthread();

#if defined(CONFIG_IOT_LOG)
    {
        iot_log_config_t log_cfg = IOT_LOG_CONFIG_DEFAULT();
        log_cfg.device_name = "TinyGS-nRF52";
        log_cfg.level = IOT_LOG_DEBUG;
        log_cfg.always_on = false;
        iot_log_init(&log_cfg);
    }
#endif

    /* Check if device has Thread credentials (commissioned).
     * If not, stay fully awake for 15 minutes to allow Joiner commissioning.
     * The user needs time to scan the QR code from index.html. */
    {
        struct openthread_context *ot_ctx = openthread_get_default_context();
        if (ot_ctx) {
            openthread_api_mutex_lock(ot_ctx);
            bool commissioned = otDatasetIsCommissioned(ot_ctx->instance);
            openthread_api_mutex_unlock(ot_ctx);

