Bwooce/tinygs_nRF52/src/main.cpp
            if (!commissioned) {
                LOG_INF("*** COMMISSIONING MODE ***");
                LOG_INF("Device not provisioned — staying awake for 15 minutes");
                LOG_INF("Joiner PSKd: %s", CONFIG_OPENTHREAD_JOINER_PSKD);
                LOG_INF("Scan QR code from index.html or run:");
                LOG_INF("  ot-ctl commissioner joiner add '*' %s",
                        CONFIG_OPENTHREAD_JOINER_PSKD);
                /* Keep display on during commissioning */
                tinygs_display_set_timeout(900); /* 15 minutes */
            } else {
                LOG_INF("Thread credentials found — normal mode");
            }
        }
    }

    /* tinygs_config_init() was called earlier (before setup_usb_storage)
     * so config.json sync uses authoritative NVS state. Don't double-init. */
    tinygs_display_init();
    watchdog_init();
    led_init();
    breathing_led_init();
    init_radio();
    apply_saved_modem_conf();

    int retry_count = 0;
    int mqtt_poll_fd_count = 0;
    struct zsock_pollfd mqtt_poll_fd;

    while (1) {
        switch (app_state) {

        case STATE_WAIT_THREAD:
            /* Blue blink while waiting for Thread */
            neopixel_set(0, 0, (k_uptime_get_32() / 500) % 2 ? 20 : 0,  NEO_OFF); /* Blue blink = waiting for Thread */
            if (thread_attached) {
                /* Heap stats now in periodic STATUS log */
                LOG_INF("--- Thread attached, waiting 5s for routing to stabilize ---");
                k_msleep(5000);
#if defined(CONFIG_IOT_LOG)
                /* Trigger deferred multicast join now that Thread is attached */
                iot_log_poll();
#endif
                app_state = STATE_DNS_RESOLVE;
                retry_count = 0;
            } else {
                LOG_INF("Waiting for Thread network... (%ds)", retry_count * 10);
                log_ot_diagnostics();
                retry_count++;
                k_msleep(10000);
            }
            break;

        case STATE_DNS_RESOLVE:
            /* Heap stats now in periodic STATUS log */
            log_ot_diagnostics();
            if (resolve_broker() == 0) {
                /* Sync time before MQTT connect so the welcome payload
                 * carries a valid `time` field. Non-fatal: if SNTP fails
                 * we connect anyway and welcome just omits the time.
                 * Reconnects skip this — they reuse the cached offset so
                 * MQTT comes back fast. Drift correction is handled
                 * out-of-band by sntp_resync_work. */
                if (!time_synced) {
                    sntp_sync();
                    /* Kick off periodic drift-correction regardless of
                     * boot-sync success — if boot failed, tomorrow's
                     * attempt might succeed. */
                    k_work_reschedule(&sntp_resync_work, SNTP_RESYNC_INTERVAL);
                }
                app_state = STATE_MQTT_CONNECT;
            } else {
                retry_count++;
                if (retry_count > 10) {
                    LOG_ERR("DNS failed after %d attempts", retry_count);
                    app_state = STATE_ERROR;
                } else {
                    LOG_WRN("DNS retry %d/10 in 5s...", retry_count);
                    k_msleep(5000);
                }
            }
            break;

        case STATE_MQTT_CONNECT:
            /* Heap stats now in periodic STATUS log */
            if (mqtt_tls_connect() == 0) {
                /* Set up poll fd for mqtt_input */
                mqtt_poll_fd.fd = mqtt_client.transport.tls.sock;
                mqtt_poll_fd.events = ZSOCK_POLLIN;
                mqtt_poll_fd_count = 1;

                /* Process until CONNACK or timeout */
                int wait_ms = 15000; /* 15s for TLS handshake + CONNACK */
                while (app_state == STATE_MQTT_CONNECT && wait_ms > 0) {
                    int rc = zsock_poll(&mqtt_poll_fd, mqtt_poll_fd_count, 1000);
                    if (rc > 0) {
                        mqtt_input(&mqtt_client);
                    }
                    mqtt_live(&mqtt_client);
                    wait_ms -= 1000;
                }
                if (app_state == STATE_MQTT_CONNECT) {
                    LOG_ERR("MQTT connect timeout (no CONNACK in 15s)");
                    mqtt_disconnect(&mqtt_client);
                    app_state = STATE_ERROR;
                }
            } else {
                app_state = STATE_ERROR;
            }
            break;

        case STATE_MQTT_CONNECTED: {
            LOG_INF("MQTT connected, entering main loop");
            neopixel_off(); /* NeoPixels off when stable */
            breathing_led_start(); /* Green LED breathes when connected */

            /* Time sync happens pre-connect so welcome carries a valid
             * `time` field (see STATE_DNS_RESOLVE). */

            /* TinyGS main loop — process MQTT, LoRa RX, and pings */
            uint32_t last_ping_ms = k_uptime_get_32();
            uint32_t last_status_log_ms = last_ping_ms;
            #define STATUS_LOG_INTERVAL_MS 300000 /* 5 minutes */

            while (app_state == STATE_MQTT_CONNECTED) {
                /* Poll MQTT socket for incoming data */
                int rc = zsock_poll(&mqtt_poll_fd, mqtt_poll_fd_count, 100);
                if (rc > 0) {
                    mqtt_input(&mqtt_client);
                }
                {
                    int live_ret = mqtt_live(&mqtt_client);
                    if (live_ret && live_ret != -EAGAIN) {
                        LOG_DBG("mqtt_live: %d (%s)", live_ret, errno_name(live_ret));
                    }
                    /* Zephyr mqtt_client doesn't auto-disconnect on missed
                     * PINGRESPs — it just increments unacked_ping forever.
                     * Force a clean reconnect after 2 missed responses so
                     * the server drops our stale session rather than
                     * waiting for the 600 s watchdog (which we saw fire
                     * 4× overnight from NAT64 idle hangs).
                     * PubSubClient on ESP32 does this for free. */
                    if (mqtt_client.unacked_ping >= TINYGS_MQTT_UNACKED_PING_MAX) {
                        LOG_WRN("MQTT: %d unacked PINGREQs — forcing reconnect",
                                mqtt_client.unacked_ping);
                        mqtt_disconnect(&mqtt_client);
                        app_state = STATE_MQTT_CONNECT;
                        break;
                    }
                }

